{"backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Model", "config": {"name": "psp-resnet34", "output_layers": [["sigmoid", 0, 0]], "input_layers": [["data", 0, 0]], "layers": [{"name": "data", "config": {"batch_input_shape": [null, 288, 288, 3], "sparse": false, "dtype": "float32", "name": "data"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "bn_data", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "epsilon": 2e-05, "name": "bn_data", "center": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false}, "class_name": "BatchNormalization", "inbound_nodes": [[["data", 0, 0, {}]]]}, {"name": "zero_padding2d_1", "config": {"trainable": true, "name": "zero_padding2d_1", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["bn_data", 0, 0, {}]]]}, {"name": "conv0", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "name": "conv0", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [2, 2], "use_bias": false, "padding": "valid", "kernel_size": [7, 7], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"name": "bn0", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "epsilon": 2e-05, "name": "bn0", "center": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"name": "relu0", "config": {"trainable": true, "name": "relu0", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"name": "zero_padding2d_2", "config": {"trainable": true, "name": "zero_padding2d_2", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["relu0", 0, 0, {}]]]}, {"name": "pooling0", "config": {"name": "pooling0", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [3, 3]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]]}, {"name": "stage1_unit1_bn1", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "epsilon": 2e-05, "name": "stage1_unit1_bn1", "center": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["pooling0", 0, 0, {}]]]}, {"name": "stage1_unit1_relu1", "config": {"trainable": true, "name": "stage1_unit1_relu1", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_3", "config": {"trainable": true, "name": "zero_padding2d_3", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]}, {"name": "stage1_unit1_conv1", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "name": "stage1_unit1_conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "use_bias": false, "padding": "valid", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "stage1_unit1_bn2", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "epsilon": 2e-05, "name": "stage1_unit1_bn2", "center": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]]}, {"name": "stage1_unit1_relu2", "config": {"trainable": true, "name": "stage1_unit1_relu2", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_4", "config": {"trainable": true, "name": "zero_padding2d_4", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]]}, {"name": "stage1_unit1_conv2", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "name": "stage1_unit1_conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "use_bias": false, "padding": "valid", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]]}, {"name": "stage1_unit1_sc", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "name": "stage1_unit1_sc", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "use_bias": false, "padding": "valid", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]}, {"name": "add_1", "config": {"trainable": true, "name": "add_1"}, "class_name": "Add", "inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]]}, {"name": "stage1_unit2_bn1", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "epsilon": 2e-05, "name": "stage1_unit2_bn1", "center": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "stage1_unit2_relu1", "config": {"trainable": true, "name": "stage1_unit2_relu1", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_5", "config": {"trainable": true, "name": "zero_padding2d_5", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]]}, {"name": "stage1_unit2_conv1", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "name": "stage1_unit2_conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "use_bias": false, "padding": "valid", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]]}, {"name": "stage1_unit2_bn2", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "epsilon": 2e-05, "name": "stage1_unit2_bn2", "center": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]]}, {"name": "stage1_unit2_relu2", "config": {"trainable": true, "name": "stage1_unit2_relu2", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_6", "config": {"trainable": true, "name": "zero_padding2d_6", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]]}, {"name": "stage1_unit2_conv2", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "name": "stage1_unit2_conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "use_bias": false, "padding": "valid", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]]}, {"name": "add_2", "config": {"trainable": true, "name": "add_2"}, "class_name": "Add", "inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}], ["add_1", 0, 0, {}]]]}, {"name": "stage1_unit3_bn1", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "epsilon": 2e-05, "name": "stage1_unit3_bn1", "center": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "stage1_unit3_relu1", "config": {"trainable": true, "name": "stage1_unit3_relu1", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["stage1_unit3_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_7", "config": {"trainable": true, "name": "zero_padding2d_7", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage1_unit3_relu1", 0, 0, {}]]]}, {"name": "stage1_unit3_conv1", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "name": "stage1_unit3_conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "use_bias": false, "padding": "valid", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_7", 0, 0, {}]]]}, {"name": "stage1_unit3_bn2", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "epsilon": 2e-05, "name": "stage1_unit3_bn2", "center": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["stage1_unit3_conv1", 0, 0, {}]]]}, {"name": "stage1_unit3_relu2", "config": {"trainable": true, "name": "stage1_unit3_relu2", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["stage1_unit3_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_8", "config": {"trainable": true, "name": "zero_padding2d_8", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage1_unit3_relu2", 0, 0, {}]]]}, {"name": "stage1_unit3_conv2", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "name": "stage1_unit3_conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "use_bias": false, "padding": "valid", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]]}, {"name": "add_3", "config": {"trainable": true, "name": "add_3"}, "class_name": "Add", "inbound_nodes": [[["stage1_unit3_conv2", 0, 0, {}], ["add_2", 0, 0, {}]]]}, {"name": "stage2_unit1_bn1", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "epsilon": 2e-05, "name": "stage2_unit1_bn1", "center": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "stage2_unit1_relu1", "config": {"trainable": true, "name": "stage2_unit1_relu1", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_9", "config": {"trainable": true, "name": "zero_padding2d_9", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]}, {"name": "stage2_unit1_conv1", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "name": "stage2_unit1_conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [2, 2], "use_bias": false, "padding": "valid", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]]}, {"name": "stage2_unit1_bn2", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "epsilon": 2e-05, "name": "stage2_unit1_bn2", "center": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]]}, {"name": "stage2_unit1_relu2", "config": {"trainable": true, "name": "stage2_unit1_relu2", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_10", "config": {"trainable": true, "name": "zero_padding2d_10", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]]}, {"name": "stage2_unit1_conv2", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "name": "stage2_unit1_conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "use_bias": false, "padding": "valid", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_10", 0, 0, {}]]]}, {"name": "stage2_unit1_sc", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "name": "stage2_unit1_sc", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [2, 2], "use_bias": false, "padding": "valid", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]}, {"name": "add_4", "config": {"trainable": true, "name": "add_4"}, "class_name": "Add", "inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]]}, {"name": "stage2_unit2_bn1", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "epsilon": 2e-05, "name": "stage2_unit2_bn1", "center": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "stage2_unit2_relu1", "config": {"trainable": true, "name": "stage2_unit2_relu1", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_11", "config": {"trainable": true, "name": "zero_padding2d_11", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]]}, {"name": "stage2_unit2_conv1", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "name": "stage2_unit2_conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "use_bias": false, "padding": "valid", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_11", 0, 0, {}]]]}, {"name": "stage2_unit2_bn2", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "epsilon": 2e-05, "name": "stage2_unit2_bn2", "center": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]]}, {"name": "stage2_unit2_relu2", "config": {"trainable": true, "name": "stage2_unit2_relu2", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_12", "config": {"trainable": true, "name": "zero_padding2d_12", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]]}, {"name": "stage2_unit2_conv2", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "name": "stage2_unit2_conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "use_bias": false, "padding": "valid", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_12", 0, 0, {}]]]}, {"name": "add_5", "config": {"trainable": true, "name": "add_5"}, "class_name": "Add", "inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}], ["add_4", 0, 0, {}]]]}, {"name": "stage2_unit3_bn1", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "epsilon": 2e-05, "name": "stage2_unit3_bn1", "center": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "stage2_unit3_relu1", "config": {"trainable": true, "name": "stage2_unit3_relu1", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["stage2_unit3_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_13", "config": {"trainable": true, "name": "zero_padding2d_13", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage2_unit3_relu1", 0, 0, {}]]]}, {"name": "stage2_unit3_conv1", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "name": "stage2_unit3_conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "use_bias": false, "padding": "valid", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_13", 0, 0, {}]]]}, {"name": "stage2_unit3_bn2", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "epsilon": 2e-05, "name": "stage2_unit3_bn2", "center": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["stage2_unit3_conv1", 0, 0, {}]]]}, {"name": "stage2_unit3_relu2", "config": {"trainable": true, "name": "stage2_unit3_relu2", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["stage2_unit3_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_14", "config": {"trainable": true, "name": "zero_padding2d_14", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage2_unit3_relu2", 0, 0, {}]]]}, {"name": "stage2_unit3_conv2", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "name": "stage2_unit3_conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "use_bias": false, "padding": "valid", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_14", 0, 0, {}]]]}, {"name": "add_6", "config": {"trainable": true, "name": "add_6"}, "class_name": "Add", "inbound_nodes": [[["stage2_unit3_conv2", 0, 0, {}], ["add_5", 0, 0, {}]]]}, {"name": "stage2_unit4_bn1", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "epsilon": 2e-05, "name": "stage2_unit4_bn1", "center": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "stage2_unit4_relu1", "config": {"trainable": true, "name": "stage2_unit4_relu1", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["stage2_unit4_bn1", 0, 0, {}]]]}, {"name": "zero_padding2d_15", "config": {"trainable": true, "name": "zero_padding2d_15", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage2_unit4_relu1", 0, 0, {}]]]}, {"name": "stage2_unit4_conv1", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "name": "stage2_unit4_conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "use_bias": false, "padding": "valid", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_15", 0, 0, {}]]]}, {"name": "stage2_unit4_bn2", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "epsilon": 2e-05, "name": "stage2_unit4_bn2", "center": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["stage2_unit4_conv1", 0, 0, {}]]]}, {"name": "stage2_unit4_relu2", "config": {"trainable": true, "name": "stage2_unit4_relu2", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["stage2_unit4_bn2", 0, 0, {}]]]}, {"name": "zero_padding2d_16", "config": {"trainable": true, "name": "zero_padding2d_16", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["stage2_unit4_relu2", 0, 0, {}]]]}, {"name": "stage2_unit4_conv2", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "name": "stage2_unit4_conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "use_bias": false, "padding": "valid", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_16", 0, 0, {}]]]}, {"name": "add_7", "config": {"trainable": true, "name": "add_7"}, "class_name": "Add", "inbound_nodes": [[["stage2_unit4_conv2", 0, 0, {}], ["add_6", 0, 0, {}]]]}, {"name": "stage3_unit1_bn1", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "epsilon": 2e-05, "name": "stage3_unit1_bn1", "center": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "stage3_unit1_relu1", "config": {"trainable": true, "name": "stage3_unit1_relu1", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]]}, {"name": "average_pooling2d_1", "config": {"name": "average_pooling2d_1", "data_format": "channels_last", "trainable": true, "strides": [36, 36], "padding": "same", "pool_size": [36, 36]}, "class_name": "AveragePooling2D", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"name": "average_pooling2d_2", "config": {"name": "average_pooling2d_2", "data_format": "channels_last", "trainable": true, "strides": [18, 18], "padding": "same", "pool_size": [18, 18]}, "class_name": "AveragePooling2D", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"name": "average_pooling2d_3", "config": {"name": "average_pooling2d_3", "data_format": "channels_last", "trainable": true, "strides": [12, 12], "padding": "same", "pool_size": [12, 12]}, "class_name": "AveragePooling2D", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"name": "average_pooling2d_4", "config": {"name": "average_pooling2d_4", "data_format": "channels_last", "trainable": true, "strides": [6, 6], "padding": "same", "pool_size": [6, 6]}, "class_name": "AveragePooling2D", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"name": "level1_conv", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 512, "dilation_rate": [1, 1], "name": "level1_conv", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "use_bias": false, "padding": "same", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"name": "level2_conv", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 512, "dilation_rate": [1, 1], "name": "level2_conv", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "use_bias": false, "padding": "same", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"name": "level3_conv", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 512, "dilation_rate": [1, 1], "name": "level3_conv", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "use_bias": false, "padding": "same", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"name": "level6_conv", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 512, "dilation_rate": [1, 1], "name": "level6_conv", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "use_bias": false, "padding": "same", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_4", 0, 0, {}]]]}, {"name": "level1_bn", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": -1, "epsilon": 0.001, "name": "level1_bn", "center": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["level1_conv", 0, 0, {}]]]}, {"name": "level2_bn", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": -1, "epsilon": 0.001, "name": "level2_bn", "center": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["level2_conv", 0, 0, {}]]]}, {"name": "level3_bn", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": -1, "epsilon": 0.001, "name": "level3_bn", "center": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["level3_conv", 0, 0, {}]]]}, {"name": "level6_bn", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": -1, "epsilon": 0.001, "name": "level6_bn", "center": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["level6_conv", 0, 0, {}]]]}, {"name": "level1_relu", "config": {"trainable": true, "name": "level1_relu", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["level1_bn", 0, 0, {}]]]}, {"name": "level2_relu", "config": {"trainable": true, "name": "level2_relu", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["level2_bn", 0, 0, {}]]]}, {"name": "level3_relu", "config": {"trainable": true, "name": "level3_relu", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["level3_bn", 0, 0, {}]]]}, {"name": "level6_relu", "config": {"trainable": true, "name": "level6_relu", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["level6_bn", 0, 0, {}]]]}, {"name": "resize_image_1", "config": {"trainable": true, "name": "resize_image_1", "data_format": "channels_last", "factor": [36, 36]}, "class_name": "ResizeImage", "inbound_nodes": [[["level1_relu", 0, 0, {}]]]}, {"name": "resize_image_2", "config": {"trainable": true, "name": "resize_image_2", "data_format": "channels_last", "factor": [18, 18]}, "class_name": "ResizeImage", "inbound_nodes": [[["level2_relu", 0, 0, {}]]]}, {"name": "resize_image_3", "config": {"trainable": true, "name": "resize_image_3", "data_format": "channels_last", "factor": [12, 12]}, "class_name": "ResizeImage", "inbound_nodes": [[["level3_relu", 0, 0, {}]]]}, {"name": "resize_image_4", "config": {"trainable": true, "name": "resize_image_4", "data_format": "channels_last", "factor": [6, 6]}, "class_name": "ResizeImage", "inbound_nodes": [[["level6_relu", 0, 0, {}]]]}, {"name": "concatenate_1", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "class_name": "Concatenate", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}], ["resize_image_1", 0, 0, {}], ["resize_image_2", 0, 0, {}], ["resize_image_3", 0, 0, {}], ["resize_image_4", 0, 0, {}]]]}, {"name": "conv_block_conv", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 512, "dilation_rate": [1, 1], "name": "conv_block_conv", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "use_bias": false, "padding": "same", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "conv_block_bn", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": -1, "epsilon": 0.001, "name": "conv_block_bn", "center": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_block_conv", 0, 0, {}]]]}, {"name": "conv_block_relu", "config": {"trainable": true, "name": "conv_block_relu", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_block_bn", 0, 0, {}]]]}, {"name": "final_conv", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 1, "dilation_rate": [1, 1], "name": "final_conv", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "use_bias": true, "padding": "same", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "Conv2D", "inbound_nodes": [[["conv_block_relu", 0, 0, {}]]]}, {"name": "resize_image_5", "config": {"trainable": true, "name": "resize_image_5", "data_format": "channels_last", "factor": [8, 8]}, "class_name": "ResizeImage", "inbound_nodes": [[["final_conv", 0, 0, {}]]]}, {"name": "sigmoid", "config": {"trainable": true, "name": "sigmoid", "activation": "sigmoid"}, "class_name": "Activation", "inbound_nodes": [[["resize_image_5", 0, 0, {}]]]}]}}